doc/tutorial/tsm.org
#+TITLE:     TSM Server Installation Guide
#+AUTHOR:    Thomas Stibor
#+EMAIL:     t.stibor@gsi.de
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org.css" />

* CentOS 7.2 and TSM Server 7.1.3
Setup e.g. in a KVM a CentOS 7.2 guest system with at least 12 GB RAM and 50 GB harddisk space.
The following KVM settings are used
#+BEGIN_SRC txt
<network>
  <name>kvmnatbr</name>
  <uuid>12f40c73-3377-4b7b-a704-1e4e6a6f01db</uuid>
  <forward mode='nat'>
    <nat>
      <port start='1024' end='65535'/>
    </nat>
  </forward>
  <bridge name='kvmnatbr' stp='on' delay='0'/>
  <mac address='12:54:00:e4:56:7b'/>
  <domain name='kvm'/>
  <dns>
    <host ip='192.168.254.101'>
      <hostname>tsm-centos-7-2</hostname>
    </host>
  </dns>
  <ip address='192.168.254.254' netmask='255.255.255.0'>
    <dhcp>
      <range start='192.168.254.1' end='192.168.254.253'/>
      <host mac='00:00:00:25:41:01' name='tsm-centos-7-2.kvm' ip='192.168.254.101'/>
    </dhcp>
  </ip>
</network>
#+END_SRC
For installing the KVM instance following commands are executed
#+BEGIN_SRC sh
sudo qemu-img create -fqcow2 -o preallocation=metadata tsm-centos-7-2.qcow2 50G
sudo virt-install -d --name=tsm-centos-7-2 --ram 8192 --vcpu 2 --disk path=/home/kvm/tsm-centos-7-2.qcow2,bus=virtio,cache=none,format=qcow2 \
                  --network bridge=kvmnatbr,model=virtio,mac=00:00:00:25:41:01 --os-type=linux --location=http://mirror.centos.org/centos/7/os/x86_64 -k de
#+END_SRC

During installation create a user and group named =tsm:tsm=.

** Stop and disable Firewall
#+BEGIN_SRC sh
systemctl stop firewalld
systemctl disable firewalld
#+END_SRC

** Verify that firewall is disabled
#+BEGIN_SRC sh
iptables -L
#+END_SRC

** Disable SELinux
Modify =SELINUX=enforcing= to =SELINUX=disabled= in file =/etc/sysconfig/selinux= to persistently
disable SELinux and verify after booting the settings with command
#+BEGIN_SRC sh
sestatus
#+END_SRC
** Install the following packages
#+BEGIN_SRC sh
yum install ksh libaio rsh lsscsi compat-glibc*
#+END_SRC
* Install TSM Server
** Download the latest TSM Server
   IBM provides binary for Linux64 at [[ftp://ftp.software.ibm.com/storage/tivoli-storage-management/maintenance/server/v7r1/Linux/]].
   Other versions (and other architectures) are provided here [[ftp://ftp.software.ibm.com/storage/tivoli-storage-management/maintenance/server/]].
** Console Installation
#+BEGIN_SRC sh
./install.sh -c -acceptLicense -vmargs "-DBYPASS_TSM_REQ_CHECKS=true"
#+END_SRC
** Package Selection
#+BEGIN_SRC txt
Select packages to install:
     1. [X] IBM® Installation Manager 1.8.2.1
     2. [X] IBM Tivoli Storage Manager server 7.1.3.20150827_1628
     3. [ ] IBM Tivoli Storage Manager languages 7.1.3.20150827_1622
     4. [X] IBM Tivoli Storage Manager license 7.1.3.20150827_1621
     5. [X] IBM Tivoli Storage Manager storage agent 7.1.3.20150827_1621
     6. [X] IBM Tivoli Storage Manager device driver 7.1.3.20150827_1624
     7. [X] IBM Tivoli Storage Manager Operations Center 7.1.3000.20150821_0553
#+END_SRC
Ignore the warnings and continue with default values by hitting N and accepting the license.
Choose a password and finally install product 1
#+BEGIN_SRC txt
Select the product that you purchased:
     1. IBM Tivoli Storage Manager
     2. IBM Tivoli Storage Manager Extended Edition
     3. IBM System Storage Archive Manager
#+END_SRC
* Login as user tsm and perform following steps
** Create directory =tsm-server= and database instance for user tsm
#+BEGIN_SRC sh
mkdir -p tsm-server && cd tsm-server
sudo /opt/tivoli/tsm/db2/instance/db2icrt -a SERVER -s ese -u tsm tsm
/opt/tivoli/tsm/db2/bin/db2 update dbm cfg using dftdbpath /home/tsm/tsm-server
#+END_SRC
** Create =dsmserv.opt= with following entries
#+BEGIN_SRC sh
echo "DEVCONFIG /home/tsm/tsm-server/devconf.dat" >> /home/tsm/tsm-server/dsmserv.opt
echo "VOLUMEHISTORY /home/tsm/tsm-server/volhist.dat" >> /home/tsm/tsm-server/dsmserv.opt
#+END_SRC
** Initialize DB2 environment by adding following lines into =$HOME/.profile=
#+BEGIN_SRC txt
if [ -f /home/tsm/sqllib/db2profile ]; then
    . /home/tsm/sqllib/db2profile
fi
#+END_SRC
and execute command
#+BEGIN_SRC sh
source $HOME/.profile
#+END_SRC
