doc/tutorial/tsm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>TSM Server Installation Guide</title>
<!-- 2017-11-01 Wed 15:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Thomas Stibor" />
<link rel="stylesheet" type="text/css" href="org.css" />
</head>
<body>
<div id="content">
<h1 class="title">TSM Server Installation Guide</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. CentOS 7.2 and TSM Server 7.1.3</a>
<ul>
<li><a href="#sec-1-1">1.1. Stop and disable Firewall</a></li>
<li><a href="#sec-1-2">1.2. Verify that firewall is disabled</a></li>
<li><a href="#sec-1-3">1.3. Disable SELinux</a></li>
<li><a href="#sec-1-4">1.4. Install the following packages</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Install TSM Server</a>
<ul>
<li><a href="#sec-2-1">2.1. Download the latest TSM Server</a></li>
<li><a href="#sec-2-2">2.2. Console Installation</a></li>
<li><a href="#sec-2-3">2.3. Package Selection</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Login as user tsm and perform following steps</a>
<ul>
<li><a href="#sec-3-1">3.1. Create directory <code>tsm-server</code> and database instance for user tsm</a></li>
<li><a href="#sec-3-2">3.2. Create <code>dsmserv.opt</code> with following entries</a></li>
<li><a href="#sec-3-3">3.3. Initialize DB2 environment by adding following lines into <code>$HOME/.profile</code></a></li>
<li><a href="#sec-3-4">3.4. Create and format database and log locations</a></li>
<li><a href="#sec-3-5">3.5. Update file <code>userprofile</code> in <code>$HOME/sqllib/userprofile</code></a></li>
<li><a href="#sec-3-6">3.6. Install TSM Client for Testing</a></li>
<li><a href="#sec-3-7">3.7. Create file <code>/home/tsm/tsm-server/tsmdbmgr.opt</code> with content</a></li>
<li><a href="#sec-3-8">3.8. Create file <code>/opt/tivoli/tsm/client/api/bin64/dsm.sys</code> with content</a></li>
<li><a href="#sec-3-9">3.9. Start TSM Server</a></li>
<li><a href="#sec-3-10">3.10. Create admin account and grant access</a></li>
<li><a href="#sec-3-11">3.11. Login from any machine with admin account as follows</a></li>
<li><a href="#sec-3-12">3.12. Register license</a></li>
<li><a href="#sec-3-13">3.13. Set Servername and IP Address</a></li>
<li><a href="#sec-3-14">3.14. Create storage directory and TSM device class assigned to this directory</a></li>
<li><a href="#sec-3-15">3.15. Create TSM storage group and assign to device class <code>fsdir_devc</code></a></li>
<li><a href="#sec-3-16">3.16. Create TSM policyset and management class</a></li>
<li><a href="#sec-3-17">3.17. Create TSM copygroup for backup and archive</a></li>
<li><a href="#sec-3-18">3.18. Assign and activate TSM management class and policyset</a></li>
<li><a href="#sec-3-19">3.19. Register node and bind to domain</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Perform an archiving task</a></li>
<li><a href="#sec-5">5. Frequent commands</a>
<ul>
<li><a href="#sec-5-1">5.1. Query space occupation</a></li>
<li><a href="#sec-5-2">5.2. Remove Node</a>
<ul>
<li><a href="#sec-5-2-1">5.2.1. Try to remove a node</a></li>
<li><a href="#sec-5-2-2">5.2.2. Query the filespace</a></li>
<li><a href="#sec-5-2-3">5.2.3. Delete filespace of node</a></li>
</ul>
</li>
<li><a href="#sec-5-3">5.3. Set Maximum Number of Mount Points</a></li>
<li><a href="#sec-5-4">5.4. Set Archive Delete Flag</a></li>
<li><a href="#sec-5-5">5.5. Update password and remove password expiration</a></li>
<li><a href="#sec-5-6">5.6. SQL query List fs,hl,ll</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Useful links</a>
<ul>
<li><a href="#sec-6-1">6.1. IBM documentation on TSM</a></li>
<li><a href="#sec-6-2">6.2. TSM Wiki</a></li>
<li><a href="#sec-6-3">6.3. Great Stuff about IBM Tivoli Storage Manager (TSM Monitor, SQL, TSM Scripts)</a></li>
<li><a href="#sec-6-4">6.4. TSM SQL Hints</a></li>
<li><a href="#sec-6-5">6.5. Lustre HSM copytool</a></li>
<li><a href="#sec-6-6">6.6. Lustre HSM architecture</a></li>
<li><a href="#sec-6-7">6.7. Lustre HSM Presentations</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> CentOS 7.2 and TSM Server 7.1.3</h2>
<div class="outline-text-2" id="text-1">
<p>
Setup e.g. in a KVM a CentOS 7.2 guest system with at least 12 GB RAM and 50 GB harddisk space.
The following KVM settings are used
</p>
<div class="org-src-container">

<pre class="src src-txt">&lt;network&gt;
  &lt;name&gt;kvmnatbr&lt;/name&gt;
  &lt;uuid&gt;12f40c73-3377-4b7b-a704-1e4e6a6f01db&lt;/uuid&gt;
  &lt;forward mode='nat'&gt;
    &lt;nat&gt;
      &lt;port start='1024' end='65535'/&gt;
    &lt;/nat&gt;
  &lt;/forward&gt;
  &lt;bridge name='kvmnatbr' stp='on' delay='0'/&gt;
  &lt;mac address='12:54:00:e4:56:7b'/&gt;
  &lt;domain name='kvm'/&gt;
  &lt;dns&gt;
    &lt;host ip='192.168.254.101'&gt;
      &lt;hostname&gt;tsm-centos-7-2&lt;/hostname&gt;
    &lt;/host&gt;
  &lt;/dns&gt;
  &lt;ip address='192.168.254.254' netmask='255.255.255.0'&gt;
    &lt;dhcp&gt;
      &lt;range start='192.168.254.1' end='192.168.254.253'/&gt;
      &lt;host mac='00:00:00:25:41:01' name='tsm-centos-7-2.kvm' ip='192.168.254.101'/&gt;
    &lt;/dhcp&gt;
  &lt;/ip&gt;
&lt;/network&gt;
</pre>
</div>
<p>
For installing the KVM instance following commands are executed
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo qemu-img create -fqcow2 -o preallocation=metadata tsm-centos-7-2.qcow2 50G
sudo virt-install -d --name=tsm-centos-7-2 --ram 8192 --vcpu 2 --disk path=/home/kvm/tsm-centos-7-2.qcow2,bus=virtio,cache=none,format=qcow2 \
		  --network bridge=kvmnatbr,model=virtio,mac=00:00:00:25:41:01 --os-type=linux --location=http://mirror.centos.org/centos/7/os/x86_64 -k de
</pre>
</div>

<p>
During installation create a user and group named <code>tsm:tsm</code>.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Stop and disable Firewall</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-sh">systemctl stop firewalld
systemctl disable firewalld
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Verify that firewall is disabled</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-sh">iptables -L
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Disable SELinux</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Modify <code>SELINUX=enforcing</code> to <code>SELINUX=disabled</code> in file <code>/etc/sysconfig/selinux</code> to persistently
disable SELinux and verify after booting the settings with command
</p>
<div class="org-src-container">

<pre class="src src-sh">sestatus
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Install the following packages</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-sh">yum install ksh libaio rsh lsscsi compat-glibc*
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Install TSM Server</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Download the latest TSM Server</h3>
<div class="outline-text-3" id="text-2-1">
<p>
IBM provides binary for Linux64 at <a href="ftp://ftp.software.ibm.com/storage/tivoli-storage-management/maintenance/server/v7r1/Linux/">ftp://ftp.software.ibm.com/storage/tivoli-storage-management/maintenance/server/v7r1/Linux/</a>.
Other versions (and other architectures) are provided here <a href="ftp://ftp.software.ibm.com/storage/tivoli-storage-management/maintenance/server/">ftp://ftp.software.ibm.com/storage/tivoli-storage-management/maintenance/server/</a>.
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Console Installation</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-sh">./install.sh -c -acceptLicense -vmargs "-DBYPASS_TSM_REQ_CHECKS=true"
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Package Selection</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-txt">Select packages to install:
     1. [X] IBM® Installation Manager 1.8.2.1
     2. [X] IBM Tivoli Storage Manager server 7.1.3.20150827_1628
     3. [ ] IBM Tivoli Storage Manager languages 7.1.3.20150827_1622
     4. [X] IBM Tivoli Storage Manager license 7.1.3.20150827_1621
     5. [X] IBM Tivoli Storage Manager storage agent 7.1.3.20150827_1621
     6. [X] IBM Tivoli Storage Manager device driver 7.1.3.20150827_1624
     7. [X] IBM Tivoli Storage Manager Operations Center 7.1.3000.20150821_0553
</pre>
</div>
<p>
Ignore the warnings and continue with default values by hitting N and accepting the license.
Choose a password and finally install product 1
</p>
<div class="org-src-container">

<pre class="src src-txt">Select the product that you purchased:
     1. IBM Tivoli Storage Manager
     2. IBM Tivoli Storage Manager Extended Edition
     3. IBM System Storage Archive Manager
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Login as user tsm and perform following steps</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Create directory <code>tsm-server</code> and database instance for user tsm</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sh">mkdir -p tsm-server &amp;&amp; cd tsm-server
sudo /opt/tivoli/tsm/db2/instance/db2icrt -a SERVER -s ese -u tsm tsm
/opt/tivoli/tsm/db2/bin/db2 update dbm cfg using dftdbpath /home/tsm/tsm-server
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Create <code>dsmserv.opt</code> with following entries</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-sh">echo "DEVCONFIG /home/tsm/tsm-server/devconf.dat" &gt;&gt; /home/tsm/tsm-server/dsmserv.opt
echo "VOLUMEHISTORY /home/tsm/tsm-server/volhist.dat" &gt;&gt; /home/tsm/tsm-server/dsmserv.opt
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Initialize DB2 environment by adding following lines into <code>$HOME/.profile</code></h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-txt">if [ -f /home/tsm/sqllib/db2profile ]; then
    . /home/tsm/sqllib/db2profile
fi
</pre>
</div>
<p>
and execute command
</p>
<div class="org-src-container">

<pre class="src src-sh">source $HOME/.profile
</pre>
</div>
</div>
</div>
