doc/tutorial/tsm.org
** Create and format database and log locations
#+BEGIN_SRC sh
cd $HOME/tsm-server && mkdir -p db && mkdir -p log/active_log && mkdir -p log/archive_log
$HOME/sqllib/adm/db2set -i tsm DB2CODEPAGE=819
dsmserv format dbdir=/home/tsm/tsm-server/db activelogsize=8196 activelogdir=/home/tsm/tsm-server/log/active_log archlogdir=/home/tsm/tsm-server/log/archive_log
#+END_SRC
** Update file =userprofile= in =$HOME/sqllib/userprofile=
#+BEGIN_SRC txt
export DSMI_CONFIG=/home/tsm/tsm-server/tsmdbmgr.opt
export DSMI_DIR=/opt/tivoli/tsm/client/api/bin64
export DSMI_LOG=/home/tsm/tsm-server
#+END_SRC
** Install TSM Client for Testing
#+BEGIN_SRC sh
rpm --install /mnt/dvd/tsmcli/linux86/gskcrypt64-8.0.50.44.linux.x86_64.rpm
              /mnt/dvd/tsmcli/linux86/gskssl64-8.0.50.44.linux.x86_64.rpm
              /mnt/dvd/tsmcli/linux86/TIVsm-BA.x86_64.rpm
              /mnt/dvd/tsmcli/linux86/TIVsm-API64.x86_64.rpm
#+END_SRC
** Create file =/home/tsm/tsm-server/tsmdbmgr.opt= with content
#+BEGIN_SRC txt
servername lxdv81-kvm-tsm-server
#+END_SRC

** Create file =/opt/tivoli/tsm/client/api/bin64/dsm.sys= with content
#+BEGIN_SRC txt
SERVERNAME lxdv81-kvm-tsm-server
NODENAME tsm-centos-7-2.kvm
TCPSERVERADDRESS 192.168.254.101
#+END_SRC

** Start TSM Server
#+BEGIN_SRC sh
dsmserv
#+END_SRC

** Create admin account and grant access
#+BEGIN_SRC sh
TSM:SERVER1> register admin admin admin
TSM:SERVER1> grant authority admin class=system
#+END_SRC

** Login from any machine with admin account as follows
#+BEGIN_SRC sh
dsmadmc -se=lxdv81-kvm-tsm-server -id=admin -password=admin
#+END_SRC
and make sure file =/opt/tivoli/tsm/client/ba/bin/dsm.sys= has entries
#+BEGIN_SRC txt
SErvername lxdv81-kvm-tsm-server
   Nodename lxdv81
   TCPServeraddress 192.168.254.101
#+END_SRC

** Register license
Login with admin account as execute
#+BEGIN_SRC sh
register license file=/opt/tivoli/tsm/server/bin/tsmbasic.lic
register license file=/opt/tivoli/tsm/server/bin/tsmee.lic
register license file=/opt/tivoli/tsm/server/bin/dataret.lic

query license
#+END_SRC

** Set Servername and IP Address
#+BEGIN_SRC sh
dsmadmc -se=lxdv81-kvm-tsm-server -id=admin -password=admin
set servername lxdv81-kvm-tsm-server
set serverhladdress 192.168.254.101
q status
#+END_SRC

** Create storage directory and TSM device class assigned to this directory
#+BEGIN_SRC sh
mkdir /home/tsm/tsm-storage
#+END_SRC
#+BEGIN_SRC sh
define devc fsdir_devc devt=file maxcap=15G dir=/home/tsm/tsm-storage
q devc
#+END_SRC
** Create TSM storage group and assign to device class =fsdir_devc=
#+BEGIN_SRC sh
define stg fsdir_stg fsdir_devc maxscr=999
q stg
#+END_SRC

#+BEGIN_SRC sh
define domain 1year_domain archretention=365 backretention=365 description="1 year retention backup and archive"
define domain 10year_domain archretention=3650 backretention=3650 description="10 year retention backup and archive"
q domain
#+END_SRC
** Create TSM policyset and management class
#+BEGIN_SRC sh
define policyset 10year_domain fsdir10year_policyset
define policyset 1year_domain fsdir1year_policyset
q policyset f=d

define mgmtclass 10year_domain fsdir10year_policyset fsdir10year_mgmtclass
define mgmtclass 1year_domain fsdir1year_policyset fsdir1year_mgmtclass
q mgmtclass
#+END_SRC
** Create TSM copygroup for backup and archive
#+BEGIN_SRC sh
define copygroup 10year_domain fsdir10year_policyset fsdir10year_mgmtclass dest=fsdir_stg
define copygroup 10year_domain fsdir10year_policyset fsdir10year_mgmtclass dest=fsdir_stg type=archive

define copygroup 1year_domain fsdir1year_policyset fsdir1year_mgmtclass dest=fsdir_stg
define copygroup 1year_domain fsdir1year_policyset fsdir1year_mgmtclass dest=fsdir_stg type=archive

q copygroup
#+END_SRC
** Assign and activate TSM management class and policyset
#+BEGIN_SRC sh
assign defmgmt 10year_domain fsdir10year_policyset fsdir10year_mgmtclass
assign defmgmt 1year_domain fsdir1year_policyset fsdir1year_mgmtclass

q domain 10year_domain
q domain 1year_domain

activate policyset 10year_domain fsdir10year_policyset
activate policyset 1year_domain fsdir1year_policyset

q domain 10year_domain
q domain 1year_domain
#+END_SRC
** Register node and bind to domain
#+BEGIN_SRC sh
register node lxdv81 lxdv81 domain=10year_domain
#+END_SRC
