doc/tutorial/tsm.html
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Create and format database and log locations</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-sh">cd $HOME/tsm-server &amp;&amp; mkdir -p db &amp;&amp; mkdir -p log/active_log &amp;&amp; mkdir -p log/archive_log
$HOME/sqllib/adm/db2set -i tsm DB2CODEPAGE=819
dsmserv format dbdir=/home/tsm/tsm-server/db activelogsize=8196 activelogdir=/home/tsm/tsm-server/log/active_log archlogdir=/home/tsm/tsm-server/log/archive_log
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Update file <code>userprofile</code> in <code>$HOME/sqllib/userprofile</code></h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">

<pre class="src src-txt">export DSMI_CONFIG=/home/tsm/tsm-server/tsmdbmgr.opt
export DSMI_DIR=/opt/tivoli/tsm/client/api/bin64
export DSMI_LOG=/home/tsm/tsm-server
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Install TSM Client for Testing</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">

<pre class="src src-sh">rpm --install /mnt/dvd/tsmcli/linux86/gskcrypt64-8.0.50.44.linux.x86_64.rpm
	      /mnt/dvd/tsmcli/linux86/gskssl64-8.0.50.44.linux.x86_64.rpm
	      /mnt/dvd/tsmcli/linux86/TIVsm-BA.x86_64.rpm
	      /mnt/dvd/tsmcli/linux86/TIVsm-API64.x86_64.rpm
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Create file <code>/home/tsm/tsm-server/tsmdbmgr.opt</code> with content</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-src-container">

<pre class="src src-txt">servername lxdv81-kvm-tsm-server
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> Create file <code>/opt/tivoli/tsm/client/api/bin64/dsm.sys</code> with content</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">

<pre class="src src-txt">SERVERNAME lxdv81-kvm-tsm-server
NODENAME tsm-centos-7-2.kvm
TCPSERVERADDRESS 192.168.254.101
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> Start TSM Server</h3>
<div class="outline-text-3" id="text-3-9">
<div class="org-src-container">

<pre class="src src-sh">dsmserv
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> Create admin account and grant access</h3>
<div class="outline-text-3" id="text-3-10">
<div class="org-src-container">

<pre class="src src-sh">TSM:SERVER1&gt; register admin admin admin
TSM:SERVER1&gt; grant authority admin class=system
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> Login from any machine with admin account as follows</h3>
<div class="outline-text-3" id="text-3-11">
<div class="org-src-container">

<pre class="src src-sh">dsmadmc -se=lxdv81-kvm-tsm-server -id=admin -password=admin
</pre>
</div>
<p>
and make sure file <code>/opt/tivoli/tsm/client/ba/bin/dsm.sys</code> has entries
</p>
<div class="org-src-container">

<pre class="src src-txt">SErvername lxdv81-kvm-tsm-server
   Nodename lxdv81
   TCPServeraddress 192.168.254.101
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-12" class="outline-3">
<h3 id="sec-3-12"><span class="section-number-3">3.12</span> Register license</h3>
<div class="outline-text-3" id="text-3-12">
<p>
Login with admin account as execute
</p>
<div class="org-src-container">

<pre class="src src-sh">register license file=/opt/tivoli/tsm/server/bin/tsmbasic.lic
register license file=/opt/tivoli/tsm/server/bin/tsmee.lic
register license file=/opt/tivoli/tsm/server/bin/dataret.lic

query license
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-13" class="outline-3">
<h3 id="sec-3-13"><span class="section-number-3">3.13</span> Set Servername and IP Address</h3>
<div class="outline-text-3" id="text-3-13">
<div class="org-src-container">

<pre class="src src-sh">dsmadmc -se=lxdv81-kvm-tsm-server -id=admin -password=admin
set servername lxdv81-kvm-tsm-server
set serverhladdress 192.168.254.101
q status
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-14" class="outline-3">
<h3 id="sec-3-14"><span class="section-number-3">3.14</span> Create storage directory and TSM device class assigned to this directory</h3>
<div class="outline-text-3" id="text-3-14">
<div class="org-src-container">

<pre class="src src-sh">mkdir /home/tsm/tsm-storage
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh">define devc fsdir_devc devt=file maxcap=15G dir=/home/tsm/tsm-storage
q devc
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-15" class="outline-3">
<h3 id="sec-3-15"><span class="section-number-3">3.15</span> Create TSM storage group and assign to device class <code>fsdir_devc</code></h3>
<div class="outline-text-3" id="text-3-15">
<div class="org-src-container">

<pre class="src src-sh">define stg fsdir_stg fsdir_devc maxscr=999
q stg
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">define domain 1year_domain archretention=365 backretention=365 description="1 year retention backup and archive"
define domain 10year_domain archretention=3650 backretention=3650 description="10 year retention backup and archive"
q domain
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-16" class="outline-3">
<h3 id="sec-3-16"><span class="section-number-3">3.16</span> Create TSM policyset and management class</h3>
<div class="outline-text-3" id="text-3-16">
<div class="org-src-container">

<pre class="src src-sh">define policyset 10year_domain fsdir10year_policyset
define policyset 1year_domain fsdir1year_policyset
q policyset f=d

define mgmtclass 10year_domain fsdir10year_policyset fsdir10year_mgmtclass
define mgmtclass 1year_domain fsdir1year_policyset fsdir1year_mgmtclass
q mgmtclass
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-17" class="outline-3">
<h3 id="sec-3-17"><span class="section-number-3">3.17</span> Create TSM copygroup for backup and archive</h3>
<div class="outline-text-3" id="text-3-17">
<div class="org-src-container">

<pre class="src src-sh">define copygroup 10year_domain fsdir10year_policyset fsdir10year_mgmtclass dest=fsdir_stg
define copygroup 10year_domain fsdir10year_policyset fsdir10year_mgmtclass dest=fsdir_stg type=archive

define copygroup 1year_domain fsdir1year_policyset fsdir1year_mgmtclass dest=fsdir_stg
define copygroup 1year_domain fsdir1year_policyset fsdir1year_mgmtclass dest=fsdir_stg type=archive

q copygroup
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-18" class="outline-3">
<h3 id="sec-3-18"><span class="section-number-3">3.18</span> Assign and activate TSM management class and policyset</h3>
<div class="outline-text-3" id="text-3-18">
<div class="org-src-container">

<pre class="src src-sh">assign defmgmt 10year_domain fsdir10year_policyset fsdir10year_mgmtclass
assign defmgmt 1year_domain fsdir1year_policyset fsdir1year_mgmtclass

q domain 10year_domain
q domain 1year_domain

activate policyset 10year_domain fsdir10year_policyset
activate policyset 1year_domain fsdir1year_policyset

q domain 10year_domain
q domain 1year_domain
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-19" class="outline-3">
<h3 id="sec-3-19"><span class="section-number-3">3.19</span> Register node and bind to domain</h3>
<div class="outline-text-3" id="text-3-19">
<div class="org-src-container">

<pre class="src src-sh">register node lxdv81 lxdv81 domain=10year_domain
</pre>
</div>
</div>
</div>
</div>
