doc/tutorial/tsm.org
* Perform an archiving task
In this example we clone the telescope guiding software [[http://openphdguiding.org/][PHD2]] and archive the data
#+BEGIN_SRC sh
git clone https://github.com/OpenPHDGuiding/phd2
dsmc archive -subdir=yes -se=LXDV81-KVM-TSM-SERVER /home/tstibor/tsm-testing/to_archive/phd2/
IBM Tivoli Storage Manager
Command Line Backup-Archive Client Interface
  Client Version 7, Release 1, Level 3.1
  Client date/time: 01/28/2016 12:58:44
(c) Copyright by IBM Corporation and other(s) 1990, 2015. All Rights Reserved.

Node Name: LXDV81
Please enter your user id <LXDV81>: lxdv81

Please enter password for user id "LXDV81":

Session established with server LXDV81-KVM-TSM-SERVER: Linux/x86_64
  Server Version 7, Release 1, Level 3.0
  Server date/time: 01/28/2016 12:59:07  Last access: 01/28/2016 12:58:11

Archive function invoked.

ANS1898I ***** Processed       500 files *****
Directory-->               4,096 /home [Sent]
Directory-->               4,096 /home/tstibor [Sent]
Directory-->               4,096 /home/tstibor/tsm-testing [Sent]
Directory-->               4,096 /home/tstibor/tsm-testing/to_archive [Sent]
Directory-->              12,288 /home/tstibor/tsm-testing/to_archive/phd2 [Sent]
Directory-->               4,096 /home/tstibor/tsm-testing/to_archive/phd2/.git [Sent]
Directory-->               4,096 /home/tstibor/tsm-testing/to_archive/phd2/WinLibs [Sent]
Directory-->               4,096 /home/tstibor/tsm-testing/to_archive/phd2/build [Sent]
Directory-->               4,096 /home/tstibor/tsm-testing/to_archive/phd2/cam_KWIQGuider [Sent]
...
...
Normal File-->            12,288 /home/tstibor/tsm-testing/to_archive/phd2/thirdparty/openssag/usbtraffic/capture.txt [Sent]
Normal File-->               345 /home/tstibor/tsm-testing/to_archive/phd2/thirdparty/openssag/usbtraffic/connect.txt [Sent]
Normal File-->            20,664 /home/tstibor/tsm-testing/to_archive/phd2/thirdparty/openssag/usbtraffic/firmware.txt [Sent]
Archive processing of '/home/tstibor/tsm-testing/to_archive/phd2/*' finished without failure.


Total number of objects inspected:          828
Total number of objects archived:           828
Total number of objects updated:              0
Total number of objects rebound:              0
Total number of objects deleted:              0
Total number of objects expired:              0
Total number of objects failed:               0
Total number of objects encrypted:            0
Total number of objects grew:                 0
Total number of retries:                      0
Total number of bytes inspected:         142.17 MB
Total number of bytes transferred:       141.84 MB
Data transfer time:                        0.47 sec
Network data transfer rate:          305,236.54 KB/sec
Aggregate data transfer rate:         87,341.12 KB/sec
Objects compressed by:                        0%
Total data reduction ratio:                0.24%
Elapsed processing time:               00:00:01
#+END_SRC
No we delete the data and retrieve the archive back
#+BEGIN_SRC sh
rm -rf phd2
dsmc retrieve -subdir=yes -se=LXDV81-KVM-TSM-SERVER /home/tstibor/tsm-testing/to_archive/phd2/
IBM Tivoli Storage Manager
Command Line Backup-Archive Client Interface
  Client Version 7, Release 1, Level 3.1
  Client date/time: 01/28/2016 13:03:59
(c) Copyright by IBM Corporation and other(s) 1990, 2015. All Rights Reserved.

Retrieve function invoked.

Node Name: LXDV81
Please enter your user id <LXDV81>: lxdv81

Please enter password for user id "LXDV81":

Session established with server LXDV81-KVM-TSM-SERVER: Linux/x86_64
  Server Version 7, Release 1, Level 3.0
  Server date/time: 01/28/2016 13:04:23  Last access: 01/28/2016 12:59:11

ANS1898I ***** Processed       500 files *****
Retrieving          12,288 /home/tstibor/tsm-testing/to_archive/phd2 [Done]
Retrieving           4,096 /home/tstibor/tsm-testing/to_archive/phd2/build [Done]
Retrieving           4,096 /home/tstibor/tsm-testing/to_archive/phd2/cameras [Done]
Retrieving           4,096 /home/tstibor/tsm-testing/to_archive/phd2/cam_KWIQGuider [Done]
Retrieving           4,096 /home/tstibor/tsm-testing/to_archive/phd2/cmake_modules [Done]
Retrieving           4,096 /home/tstibor/tsm-testing/to_archive/phd2/contributions [Done]
Retrieving           4,096 /home/tstibor/tsm-testing/to_archive/phd2/debian [Done]
Retrieving           4,096 /home/tstibor/tsm-testing/to_archive/phd2/extra_frameworks [Done]
Retrieving           4,096 /home/tstibor/tsm-testing/to_archive/phd2/.git [Done]
Retrieving           4,096 /home/tstibor/tsm-testing/to_archive/phd2/help [Done]
...
...
Retrieving           3,979 /home/tstibor/tsm-testing/to_archive/phd2/thirdparty/openssag/src/openssag.h [Done]
Retrieving           5,825 /home/tstibor/tsm-testing/to_archive/phd2/thirdparty/openssag/src/loader.cpp [Done]
Retrieving             203 /home/tstibor/tsm-testing/to_archive/phd2/thirdparty/openssag/src/commandline/Makefile.am [Done]
Retrieving           5,935 /home/tstibor/tsm-testing/to_archive/phd2/thirdparty/openssag/src/commandline/ssag.cpp [Done]
Retrieving          50,422 /home/tstibor/tsm-testing/to_archive/phd2/thirdparty/openssag/src/firmware.h [Done]
Retrieving           2,954 /home/tstibor/tsm-testing/to_archive/phd2/thirdparty/openssag/usbtraffic/bootloader.txt [Done]
Retrieving          12,288 /home/tstibor/tsm-testing/to_archive/phd2/thirdparty/openssag/usbtraffic/capture.txt [Done]
Retrieving             345 /home/tstibor/tsm-testing/to_archive/phd2/thirdparty/openssag/usbtraffic/connect.txt [Done]
Retrieving          20,664 /home/tstibor/tsm-testing/to_archive/phd2/thirdparty/openssag/usbtraffic/firmware.txt [Done]

Retrieve processing finished.

Total number of objects retrieved:          824
Total number of objects failed:               0
Total number of bytes transferred:       141.80 MB
Data transfer time:                        0.39 sec
Network data transfer rate:          367,024.11 KB/sec
Aggregate data transfer rate:         46,696.16 KB/sec
Elapsed processing time:               00:00:03
#+END_SRC
* Frequent commands
** Query space occupation
#+BEGIN_SRC sh
q occu
q occu type=backup
q occu type=archive
q occu lxdv81 type=archive
#+END_SRC

** Remove Node
*** Try to remove a node
#+BEGIN_SRC sh
REMove Node lxdv81
Do you wish to proceed? (Yes (Y)/No (N)) Y
ANR2152E REMOVE NODE: Inventory references still exist for node LXDV81.
ANS8001I Return code 13.
#+END_SRC
*** Query the filespace
#+BEGIN_SRC sh
q filesp  lxdv81

Node Name           Filespace       FSID     Platform     Filespac-     Is Filesp-        Capacity      Pct
                    Name                                  e Type        ace Unico-                      Util
                                                                           de?
---------------     -----------     ----     --------     ---------     ----------     -----------     -----
LXDV81              /                  1     Linux        EXT2              No              467 GB      70.9
                                              x86-64
#+END_SRC
*** Delete filespace of node
#+BEGIN_SRC sh
delete filesp lxdv81 *
REMove Node lxdv81
#+END_SRC

