doc/tutorial/tsm.org
** Set Maximum Number of Mount Points
   By default, each node handles a single session. The TSM copytool however,
   handles operations such as retrieve or archive in separate threads, where each thread has a separate session
   to the TSM server. If you get the error message: ~This node has exceeded its maximum number of mount points~,
   make sure to set the parameter ~maxnummp~ to the value of maximum number of threads in the TSM copytool.
#+BEGIN_SRC sh
update node lxdv81 maxnummp=<NUMBER_OF_THREADS>
#+END_SRC
The value ~maxnummp~ can be queried with command
#+BEGIN_SRC sh
q node lxdv81 f=d
#+END_SRC
** Set Archive Delete Flag
   To specifies whether a client node can delete its own archived files
   from the server set:
#+BEGIN_SRC sh
update node lxdv81 archdelete=yes
#+END_SRC
or
#+BEGIN_SRC sh
update node lxdv81 archdelete=no
#+END_SRC
to disable deletion of the archive.
** Update password and remove password expiration
#+BEGIN_SRC sh
update node lxdv81 <NEW_PW>
update node lxdv81 passexp=0
#+END_SRC

** SQL query List fs,hl,ll
#+BEGIN_SRC sh
dsmadmc -se=polaris-kvm-tsm-server -id=admin -password='<MYPASSWD>' -commadelimited "select FILESPACE_NAME,HL_NAME,LL_NAME from ARCHIVES WHERE NODE_NAME = '<MY_NODE>'"
#+END_SRC
* Useful links
** IBM documentation on TSM
- [[http://web-docs.gsi.de/~tstibor/tsm/doc/ibm_tivoli_storage_management_concepts.pdf][IBM Tivoli Storage Management Concepts]]
- [[http://web-docs.gsi.de/~tstibor/tsm/doc/ibm_tivoli_storage_management_implementation_guide.pdf][IBM Tivoli Storage Management Implementation Guide]]
- [[http://web-docs.gsi.de/~tstibor/tsm/doc/using_the_programming_application_interface.pdf][API Using the Programming Application Interface]]
- [[http://web-docs.gsi.de/~tstibor/tsm/doc/IBM_beyond_backup_toward_storage_management_white_paper.pdf][IBM Beyond Backup Toward Storage Management White Paper]]
** TSM Wiki
- http://emmanuel.iffly.free.fr/doku.php?id=tsm:tsm
- [[http://wiki.fysik.dtu.dk/it/TSM-server-configuration][TSM-server-configuration]]
** Great Stuff about IBM Tivoli Storage Manager (TSM Monitor, SQL, TSM Scripts)
- http://thobias.org/tsm/
** TSM SQL Hints
- http://www.lascon.co.uk/tsm-sql-queries.php
** Lustre HSM copytool
- [[http://sourceforge.net/projects/lustrehpss/][Lustre HPSS copytool]]
- [[http://git.hpdd.intel.com/fs/lustre-release.git/blob/HEAD:/lustre/utils/lhsmtool_posix.c][Lustre Posix copytool]]
** Lustre HSM architecture
- [[http://wiki.old.lustre.org/index.php/Architecture_-_HSM_Migration][Architecture HSM Migration]]
** Lustre HSM Presentations
- [[https://w3.hepix.org/storage/hep_pdf/2010/Spring/Lustre-HSM_HEPIX.pdf][Lustre-HSM binding]]
- [[http://cdn.opensfs.org/wp-content/uploads/2015/04/Lustre-HSM-in-the-Cloud_Read.pdf][Lustre* HSM in the Cloud]]
- [[http://www.eofs.eu/fileadmin/lad2013/slides/10_Aurelien_Degremont_lustre_hsm_lad13.pdf][Lustre/HSM is there!]]
