doc/tutorial/tsm.html

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Set Maximum Number of Mount Points</h3>
<div class="outline-text-3" id="text-5-3">
<p>
By default, each node handles a single session. The TSM copytool however,
handles operations such as retrieve or archive in separate threads, where each thread has a separate session
to the TSM server. If you get the error message: <code>This node has exceeded its maximum number of mount points</code>,
make sure to set the parameter <code>maxnummp</code> to the value of maximum number of threads in the TSM copytool.
</p>
<div class="org-src-container">

<pre class="src src-sh">update node lxdv81 maxnummp=&lt;NUMBER_OF_THREADS&gt;
</pre>
</div>
<p>
The value <code>maxnummp</code> can be queried with command
</p>
<div class="org-src-container">

<pre class="src src-sh">q node lxdv81 f=d
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Set Archive Delete Flag</h3>
<div class="outline-text-3" id="text-5-4">
<p>
To specifies whether a client node can delete its own archived files
from the server set:
</p>
<div class="org-src-container">

<pre class="src src-sh">update node lxdv81 archdelete=yes
</pre>
</div>
<p>
or
</p>
<div class="org-src-container">

<pre class="src src-sh">update node lxdv81 archdelete=no
</pre>
</div>
<p>
to disable deletion of the archive.
</p>
</div>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> Update password and remove password expiration</h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">

<pre class="src src-sh">update node lxdv81 &lt;NEW_PW&gt;
update node lxdv81 passexp=0
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> SQL query List fs,hl,ll</h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">

<pre class="src src-sh">dsmadmc -se=polaris-kvm-tsm-server -id=admin -password='&lt;MYPASSWD&gt;' -commadelimited "select FILESPACE_NAME,HL_NAME,LL_NAME from ARCHIVES WHERE NODE_NAME = '&lt;MY_NODE&gt;'"
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Useful links</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> IBM documentation on TSM</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li><a href="http://web-docs.gsi.de/~tstibor/tsm/doc/ibm_tivoli_storage_management_concepts.pdf">IBM Tivoli Storage Management Concepts</a>
</li>
<li><a href="http://web-docs.gsi.de/~tstibor/tsm/doc/ibm_tivoli_storage_management_implementation_guide.pdf">IBM Tivoli Storage Management Implementation Guide</a>
</li>
<li><a href="http://web-docs.gsi.de/~tstibor/tsm/doc/using_the_programming_application_interface.pdf">API Using the Programming Application Interface</a>
</li>
<li><a href="http://web-docs.gsi.de/~tstibor/tsm/doc/IBM_beyond_backup_toward_storage_management_white_paper.pdf">IBM Beyond Backup Toward Storage Management White Paper</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> TSM Wiki</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li><a href="http://emmanuel.iffly.free.fr/doku.php?id=tsm:tsm">http://emmanuel.iffly.free.fr/doku.php?id=tsm:tsm</a>
</li>
<li><a href="http://wiki.fysik.dtu.dk/it/TSM-server-configuration">TSM-server-configuration</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Great Stuff about IBM Tivoli Storage Manager (TSM Monitor, SQL, TSM Scripts)</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li><a href="http://thobias.org/tsm/">http://thobias.org/tsm/</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> TSM SQL Hints</h3>
<div class="outline-text-3" id="text-6-4">
<ul class="org-ul">
<li><a href="http://www.lascon.co.uk/tsm-sql-queries.php">http://www.lascon.co.uk/tsm-sql-queries.php</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> Lustre HSM copytool</h3>
<div class="outline-text-3" id="text-6-5">
<ul class="org-ul">
<li><a href="http://sourceforge.net/projects/lustrehpss/">Lustre HPSS copytool</a>
</li>
<li><a href="http://git.hpdd.intel.com/fs/lustre-release.git/blob/HEAD:/lustre/utils/lhsmtool_posix.c">Lustre Posix copytool</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> Lustre HSM architecture</h3>
<div class="outline-text-3" id="text-6-6">
<ul class="org-ul">
<li><a href="http://wiki.old.lustre.org/index.php/Architecture_-_HSM_Migration">Architecture HSM Migration</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> Lustre HSM Presentations</h3>
<div class="outline-text-3" id="text-6-7">
<ul class="org-ul">
<li><a href="https://w3.hepix.org/storage/hep_pdf/2010/Spring/Lustre-HSM_HEPIX.pdf">Lustre-HSM binding</a>
</li>
<li><a href="http://cdn.opensfs.org/wp-content/uploads/2015/04/Lustre-HSM-in-the-Cloud_Read.pdf">Lustre* HSM in the Cloud</a>
</li>
<li><a href="http://www.eofs.eu/fileadmin/lad2013/slides/10_Aurelien_Degremont_lustre_hsm_lad13.pdf">Lustre/HSM is there!</a>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Thomas Stibor</p>
<p class="date">Created: 2017-11-01 Wed 15:45</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
